## RECOMENDATION ML SYSTEM

### Importing Libraries

In [28]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.metrics.pairwise import cosine_similarity

## Recomendation code

In [29]:
df_steam = pd.read_parquet('ML_data/ML_steam_EDA.gzip')
df_steam = df_steam [['Id','App_Name']]
df_steam.head(1)

           Id             App_Name
88310  761140  Lost Summoner Kitty

In [30]:
df_reviews = pd.read_parquet('ML_data/ML_reviews_EDA.gzip')
df_reviews.rename(columns={'Item_Id': 'Id'}, inplace=True)
df_reviews = df_reviews [['User_Id', 'Id', 'Sentiment_Score']]
df_reviews.head(1)

             User_Id    Id  Sentiment_Score
0  76561197970982479  1250                2

In [31]:
df_reviews = df_reviews[['User_Id', 'Id', 'Sentiment_Score']].merge(df_steam[['Id', 'App_Name']], on='Id', how='left')

In [32]:
df_reviews

                  User_Id      Id  Sentiment_Score App_Name
0       76561197970982479    1250                2      NaN
1       76561197970982479   22200                2      NaN
2       76561197970982479   43110                2      NaN
3                 js41637  251610                2      NaN
4                 js41637  227300                2      NaN
...                   ...     ...              ...      ...
325578  76561198251004808  253980                2  Enclave
325579  76561198251004808  253980                2  Enclave
325580        72947282842     730                0      NaN
325581          ApxLGhost     730                2      NaN
325582  76561198267374962  369200                2      NaN

[325583 rows x 4 columns]

In [33]:
# Counting NaN values in 'App_Name' column after the merge
nan_count = df_reviews['App_Name'].isna().sum()
print("Number of NaN values in 'App_Name' column:", nan_count)

Number of NaN values in 'App_Name' column: 34309

In [34]:
df_reviews.dropna(subset=['App_Name'], inplace=True)

In [35]:
# Counting NaN values in 'App_Name' column after the merge
nan_count = df_reviews['App_Name'].isna().sum()
print("Number of NaN values in 'App_Name' column:", nan_count)

Number of NaN values in 'App_Name' column: 0

In [36]:
# Counting duplicates in the entire dataframe
duplicates_count = df_reviews.duplicated().sum()
print("Number of duplicated rows in the dataframe:", duplicates_count)

Number of duplicated rows in the dataframe: 277085

In [37]:
df_reviews = df_reviews.drop_duplicates()

In [38]:
df_reviews.head(1)

   User_Id      Id  Sentiment_Score       App_Name
5  js41637  239030                2  Papers Please

In [39]:
df_reviews.info()

<class 'pandas.core.frame.DataFrame'>
Index: 14189 entries, 5 to 325577
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User_Id          14189 non-null  object
 1   Id               14189 non-null  object
 2   Sentiment_Score  14189 non-null  int64
 3   App_Name         14189 non-null  object
dtypes: int64(1), object(3)
memory usage: 554.3+ KB

In [44]:
df_reviews.loc[:, 'App_Name'] = df_reviews['App_Name'].astype(str)
df_reviews

                  User_Id      Id  Sentiment_Score                 App_Name
5                 js41637  239030                2            Papers Please
19              evcentric  263360                2    Futuristic Action Rpg
30                  doctr  250320                2        The Wolf Among Us
35                  doctr  224600                2                 Defiance
60              maplemage  204300                2  Awesomenauts The D Moba
...                   ...     ...              ...                      ...
325483             01shan     440                2            Team Fortress
325509  76561198236893796  383580                2             Flesh Eaters
325524  76561198236893796     440                2            Team Fortress
325550           pigeonie     440                2            Team Fortress
325577  76561198251004808  253980                2                  Enclave

[14189 rows x 4 columns]

In [43]:
df = df_reviews
df.to_parquet('ML_data/ML_function/df_ML.gzip')